whole_y a->5;
go
as_long_as(a>5){
	a ->5;
}
all_set;
go
imagine (a>5){
	a->5;
}nah{
	a->6;	
}
all_set;
go
one_by_one (a in (5,2)){
	a->5;
}
all_set;
ciao(a);
a_new_one zip prova (whole_y a){
	a->5;
}
